Repository: RayanceKing/CCZUHelper
Catalog: CCZUHelper/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hans, zh_hant

# schedule_component.duration
source: Duration
ja: コース时长
ko: 과정时长
zh_hans: 课程时长
zh_hant: 課程時長

# schedule_component.end_slot
source: Course end section number
ja: コース
ko: 과목
zh_hans: 课程结束节数
zh_hant: 課程結束节數

# schedule_component.location
source: Location
ja: 場所
ko: 장소
zh_hans: 上课地点
zh_hant: 上課地點

# schedule_component.location_placeholder
source: Location
ja: 場所
ko: 장소
zh_hans: 地点
zh_hant: 地點

# schedule_component.start_slot
source: Course start section number
ja: コース
ko: 과목
zh_hans: 课程开始节数
zh_hant: 課程開始节數

# schedule_component.teacher
source: Teacher
ja: 教師
ko: 교사
zh_hans: 授课教师
zh_hant: 授課教師

# schedule_component.week_format
source: Week %d
ja: 第%d週
ko: 주
zh_hans: 第%d周
zh_hant: 第%d週

# schedule_component.week_range_format
source: Week %d-%d
ja: 第%d-%d週
ko: 주
zh_hans: 第%d-%d周
zh_hant: 第%d-%d週

# schedule_component.weeks
source: Weeks
ja: 週
ko: 주
zh_hans: 周期
zh_hant: 週期

# schedule.period_format
source: Period %d
ja: %d時限目
ko: %d교시
zh_hans: 第%d节
zh_hant: 第%d節

# schedule.period_range_format
source: Period: %lld-%lld
ja: 時限: %lld-%lld
ko: 교시: %lld-%lld
zh_hans: 节次:%lld-%lld
zh_hant: 節次:%lld-%lld

# schedule.week_number_format
source: Week: %lld
ja: 第%lld週
ko: 주차: %lld
zh_hans: 周次:%lld
zh_hant: 周次:%lld

# schedule.week.format
source: Week %d
ja: 第%d週
ko: 주
zh_hans: 第%d周
zh_hant: 第%d週

source: Search
ja: 検索
ko: 검색
zh_hans: 搜索
zh_hant: 搜尋

# services.campus_card
source: Campus Card
ja: キャンパスカード
ko: 캠퍼스 카드
zh_hans: 校园卡
zh_hant: 校园卡

# services.campus_network
source: Campus Network
ja: キャンパスネットワーク
ko: 캠퍼스 네트워크
zh_hans: 校园网
zh_hant: 校园網

# services.common_functions
source: Common Functions
ja: 共通機能
ko: 공통 기능
zh_hans: 常用功能
zh_hant: 常用功能

# services.competition_query
source: Competition Search
ja: コンテスト検索
ko: 대회 검색
zh_hans: 竞赛查询
zh_hant: 競賽查詢

# services.course_evaluation
source: Course Evaluation
ja: コース评价
ko: 강의 평가
zh_hans: 课程评价
zh_hant: 課程評價

# services.course_selection
source: Course Selection
ja: 履修登録
ko: 수강 신청
zh_hans: 选课系统
zh_hant: 選課繫統

# services.credit_gpa
source: Credits & GPA
ja: 単位とGPA
ko: 학점 및 GPA
zh_hans: 学分绩点
zh_hant: 學分績點

# services.electricity_query
source: Electricity
ja: 電気料金
ko: 전기요금
zh_hans: 电费查询
zh_hant: 電費查詢

# services.email_system
source: Email System
ja: メールシステム
ko: 메일 시스템
zh_hans: 邮件系统
zh_hant: 郵件繫統

# services.empty_classroom
source: Empty Classroom
ja: 空き教室
ko: 빈교실
zh_hans: 空闲教室
zh_hant: 空閒教室

# services.exam_schedule
source: Exam Schedule
ja: 試験日程
ko: 시험 일정
zh_hans: 考试安排
zh_hant: 考試安排

# services.grade_query
source: Grade Query
ja: 成績照会
ko: 성적 조회
zh_hans: 成绩查询
zh_hant: 成績查詢

# services.library
source: Library
ja: 図書館
ko: 도서관
zh_hans: 图书馆
zh_hant: 圖書館

# services.more_services
source: More Services
ja: その他のサービス
ko: 더 많은 서비스
zh_hans: 更多服务
zh_hant: 更多服務

# services.quick_links
source: Quick Links
ja: クイックリンク
ko: 바로가기
zh_hans: 快捷入口
zh_hant: 快捷入口

# services.smart_campus
source: Smart Campus
ja: スマートキャンパス
ko: 스마트 캠퍼스
zh_hans: 智慧校园
zh_hant: 智慧校园

# services.teaching_notice
source: Teaching Notice
ja: 教務通知
ko: 교무 공지
zh_hans: 教务通知
zh_hant: 教務通知

# services.teaching_system
source: Teaching System
ja: 教務システム
ko: 학사 시스템
zh_hans: 教务系统
zh_hant: 教務繫統

# services.title
source: Services
ja: サービス
ko: 서비스
zh_hans: 服务
zh_hant: 服務

# services.training_plan
source: Training Plan
ja: 育成計画
ko: 교육과정
zh_hans: 培养方案
zh_hant: 培养方案

# settings.calendar_end_time
source: Calendar End Time
ja: 時間
ko: 시간
zh_hans: 日历结束时间
zh_hant: 日歷結束時間

# settings.calendar_start_time
source: Calendar Start Time
ja: 時間
ko: 시간
zh_hans: 日历开始时间
zh_hant: 日歷開始時間

# settings.course_block_opacity
source: Course Block Opacity
ja: コース
ko: 과목
zh_hans: 课程块不透明度
zh_hant: 課程块不透明度

# settings.course_block_opacity_disabled_with_glass
source: Cannot adjust course block transparency when Liquid Glass is enabled
ja: コース
ko: 과목
zh_hans: 启用Liquid Glass时无法调整课程块透明度
zh_hant: 啟用Liquid Glass時无法调整課程块透明度

# settings.course_notification
source: Course Notification
ja: コース
ko: 과목
zh_hans: 课程通知
zh_hant: 課程通知

# settings.display_settings
source: Display Settings
ja: 設定
ko: 설정
zh_hans: 显示设置
zh_hant: 顯示設置

# settings.enable_course_notification
source: Enable Course Notification
ja: コース
ko: 과목
zh_hans: 开启课程通知
zh_hant: 開啟課程通知

# settings.icloud_data_sync_hint
source: Sync schedules, courses, and app preferences to iCloud (requires iCloud sign-in in system settings).
ja: 設定
ko: 설정
zh_hans: 同步课表、课程与应用设置到 iCloud（需在系统设置中登录 iCloud）
zh_hant: 同步課表、課程与應用設置到 iCloud（需在繫統設置中登錄 iCloud）

# settings.logged_in
source: Logged In
ja: 已ログイン
ko: 已로그인
zh_hans: 已登录
zh_hant: 已登錄

# settings.login_hint
source: Click login button to sign in
ja: 点击ログイン按钮进行ログイン
ko: 点击로그인按钮进行로그인
zh_hans: 点击登录按钮进行登录
zh_hant: 點擊登錄按钮进行登錄

# settings.logout
source: Logout
ja: ログアウトログイン
ko: 로그아웃로그인
zh_hans: 退出登录
zh_hant: 退出登錄

# settings.logout_confirm_title
source: Confirm Logout
ja: 確認ログアウトログイン
ko: 확인로그아웃로그인
zh_hans: 确认退出登录
zh_hant: 確認退出登錄

# settings.manage_schedules
source: Manage Schedules
ja: 管理
ko: 관리
zh_hans: 管理课表
zh_hant: 管理課表

# settings.not_logged_in
source: Not Logged In
ja: 未ログイン
ko: 未로그인
zh_hans: 未登录
zh_hant: 未登錄

# settings.notification_settings
source: Notification Settings
ja: 設定
ko: 설정
zh_hans: 通知设置
zh_hant: 通知設置

# settings.notification_time
source: Reminder Time
ja: 時間
ko: 시간
zh_hans: 提醒时间
zh_hant: 提醒時間

# settings.other
source: Other
ja: その他
ko: 기타
zh_hans: 其他
zh_hant: 其他

# settings.schedule_management
source: Schedule Management
ja: 管理
ko: 관리
zh_hans: 课表管理
zh_hant: 課表管理

# settings.select_semester_start
source: Select First Week of Semester
ja: 週
ko: 주
zh_hans: 选择开学第一周
zh_hant: 選擇開學第一週

# settings.semester_hint
source: Select any day of the first week of semester, system will automatically calculate current week number
ja: 週
ko: 주
zh_hans: 选择学期第一周的任意一天，系统会自动计算当前为第几周
zh_hant: 選擇學期第一週的任意一天，繫統会自動計算當前為第幾週

# settings.semester_settings
source: Semester Settings
ja: 設定
ko: 설정
zh_hans: 学期设置
zh_hant: 學期設置

# settings.semester_start
source: First Week of Semester
ja: 週
ko: 주
zh_hans: 开学第一周
zh_hant: 開學第一週

# settings.show_current_timeline
source: Shows Current timeline
ja: 時間
ko: 시간
zh_hans: 显示当前时间线
zh_hant: 顯示當前時間线

# settings.show_current_timeline_desc_disabled
source: Class periods display cannot enable current timeline
ja: 時間
ko: 시간
zh_hans: 课程时间显示无法启用当前时间线
zh_hant: 課程時間顯示无法啟用當前時間线

# settings.show_time_ruler
source: Show Time Ruler
ja: 時間
ko: 시간
zh_hans: 显示时间标尺
zh_hant: 顯示時間標尺

# settings.time_interval
source: Time Interval
ja: 時間
ko: 시간
zh_hans: 时间间隔
zh_hant: 時間間隔

# settings.timeline_display_class
source: Class Time
ja: コース時間显示
ko: 시간
zh_hans: 课程时间显示
zh_hant: 課程時間顯示

# settings.timeline_display_class_desc
source: Grid by class periods
ja: 按コース时长绘制网格
zh_hans: 按课程时长绘制网格
zh_hant: 按課程時長绘製網格

# settings.timeline_display_mode
source: Timeline Display Mode
ja: 時間
ko: 시간
zh_hans: 时间轴显示方式
zh_hant: 時間轴顯示方式

# settings.timeline_display_standard
source: Standard Time
ja: 時間
ko: 시간
zh_hans: 标准时间显示
zh_hant: 標准時間顯示

# settings.title
source: Settings
ja: 設定
ko: 설정
zh_hans: 设置
zh_hant: 設置

# settings.week_start_day
source: Week Start Day
ja: 週
ko: 주
zh_hans: 每周开始日
zh_hant: 每週開始日

# sync.status.failed
source: Sync Failed
ja: 同期
ko: 동기화
zh_hans: 同步失败
zh_hant: 同步失敗

# sync.status.local
source: Local
ja: ローカル
ko: 로컬
zh_hans: 本地
zh_hant: 本地

# sync.status.synced
source: Synced
ja: 同期
ko: 동기화
zh_hans: 已同步
zh_hant: 已同步

# sync.status.syncing
source: Syncing
ja: 同期
ko: 동기화
zh_hans: 同步中
zh_hant: 同步中

# tab.schedule
source: Schedule
ja: コース表
ko: 시간표
zh_hans: 课程表
zh_hant: 課程表

# tab.services
source: Services
ja: サービス
ko: 서비스
zh_hans: 服务
zh_hant: 服務

# tab.teahouse
source: Teahouse
ja: ティーハウス
ko: 티하우스
zh_hans: 茶楼
zh_hant: 茶樓

source: Teahouse Account
ja: ティーハウスアカウント
ko: 티하우스 계정
zh_hans: 茶楼账户
zh_hant: 茶樓帳戶

# teahouse.auth.login_required_message
source: You need to log in to perform this action.
ja: 需要ログイン才能进行此操作
ko: 이 작업을 수행하려면 로그인해야 합니다.
zh_hans: 需要登录才能进行此操作
zh_hant: 需要登錄才能进行此操作

# teahouse.auth.login_required_title
source: Login Required
ja: ログインが必要です
ko: 로그인 필요
zh_hans: 请登录
zh_hant: 請登錄

# teahouse.category.confession
source: Confession
ja: 告白
ko: 고백
zh_hans: 表白墙
zh_hant: 表白墙

# teahouse.category.life
source: Life
ja: 生活
ko: 생활
zh_hans: 生活
zh_hant: 生活

# teahouse.category.lost_found
source: Lost & Found
ja: 落とし物
ko: 분실물
zh_hans: 失物招领
zh_hant: 失物招领

# teahouse.category.other
source: Other
ja: その他
ko: 기타
zh_hans: 其他
zh_hant: 其他

# teahouse.category.secondhand
source: Secondhand
ja: 中古売買
ko: 중고거래
zh_hans: 二手
zh_hant: 二手

# teahouse.category.study
source: Study
ja: 学習
ko: 학습
zh_hans: 学习
zh_hant: 學習

# teahouse.comment.anonymous.disable
source: Disable Anonymous
ja: キャンセル匿名
ko: 취소익명
zh_hans: 取消匿名
zh_hant: 取消匿名

# teahouse.comment.anonymous.enable
source: Post Anonymously
ja: 匿名で投稿
ko: 익명으로 게시
zh_hans: 设为匿名
zh_hant: 設為匿名

# teahouse.comment.delete_again
source: Tap again to delete
ja: もう一度タップで削除
ko: 다시 탭하면 삭제
zh_hans: 再次点击删除
zh_hant: 再次點擊刪除

# teahouse.comment.delete_message
source: Are you sure you want to delete this comment? This action cannot be undone.
ja: このコメントを削除しますか？この操作は元に戻せません。
ko: 이 댓글을 삭제하시겠습니까? 이 작업은 되돌릴 수 없습니다.
zh_hans: 确定要删除这条评论吗？此操作不可撤销。
zh_hant: 確定要刪除这条評論吗？此操作不可撤銷。

# teahouse.create_post
source: Create Post
ja: 投稿を作成
ko: 게시게시물
zh_hans: 发布帖子
zh_hant: 發佈帖子

# teahouse.days_ago
source: %d days ago
ja: %d日前
ko: %d일 전
zh_hans: %d天前
zh_hant: %d天前

# teahouse.hide_banners
source: Hide Banners
ja: バナーを非表示
ko: 배너 숨기기
zh_hans: 关闭横幅
zh_hant: 關闭横幅

# teahouse.hide_banners.description
source: Hide banner notifications in the teahouse
ja: 茶楼のバナー通知を非表示にする
ko: 찻집의 배너 알림 숨기기
zh_hans: 隐藏茶楼中的横幅通知
zh_hant: 隱藏茶樓中的横幅通知

# teahouse.hide_banners.product_unavailable
source: Product is temporarily unavailable. Please try again later.
ja: 現在購入項目を取得できません。しばらくしてから再試行してください。
ko: 현재 구매 항목을 불러올 수 없습니다. 잠시 후 다시 시도해 주세요.
zh_hans: 暂时无法获取购买项，请稍后重试
zh_hant: 暫時無法獲取購買項，請稍後重試

# teahouse.hide_banners.purchase_button
source: Buy Now
ja: 今すぐ購入
ko: 지금 구매
zh_hans: 立即购买
zh_hant: 立即購買

# teahouse.hide_banners.purchase_failed
source: Purchase failed. Please try again later.
ja: 購入に失敗しました。しばらくしてから再試行してください。
ko: 구매에 실패했습니다. 잠시 후 다시 시도해 주세요.
zh_hans: 购买失败，请稍后重试
zh_hant: 購買失敗，請稍後重試

# teahouse.hide_banners.purchase_failed_title
source: Purchase Failed
ja: 購入に失敗しました
ko: 구매 실패
zh_hans: 购买失败
zh_hant: 購買失敗

# teahouse.hide_banners.purchase_hint
source: Purchase required for this feature
ja: この機能は購入後に利用できます
ko: 이 기능은 구매 후 사용할 수 있습니다
zh_hans: 此功能需购买后使用
zh_hant: 此功能需購買後使用

# teahouse.hide_banners.purchase_message
source: Hiding Teahouse banners is a paid feature. Purchase to unlock permanent banner hiding.
ja: 茶楼のバナー非表示は有料機能です。購入すると恒久的に非表示にできます。
ko: 티하우스 배너 숨기기는 유료 기능입니다. 구매하면 배너를 영구적으로 숨길 수 있습니다.
zh_hans: 关闭茶楼横幅为付费功能，购买后可永久关闭横幅。
zh_hant: 關閉茶樓橫幅為付費功能，購買後可永久關閉橫幅。

# teahouse.hide_banners.purchase_pending
source: Purchase is pending system confirmation.
ja: 購入リクエストを送信しました。システム確認をお待ちください。
ko: 구매 요청이 제출되었습니다. 시스템 확인을 기다려 주세요.
zh_hans: 购买请求已提交，等待系统确认
zh_hant: 購買請求已提交，等待系統確認

# teahouse.hide_banners.purchase_title
source: Purchase Banner Toggle
ja: バナー非表示を購入
ko: 배너 숨기기 기능 구매
zh_hans: 购买关闭横幅
zh_hant: 購買關閉橫幅

# teahouse.hide_banners.purchase_verification_failed
source: Purchase verification failed. Please try again.
ja: 購入の検証に失敗しました。しばらくしてから再試行してください。
ko: 구매 검증에 실패했습니다. 잠시 후 다시 시도해 주세요.
zh_hans: 购买校验失败，请稍后重试
zh_hant: 購買校驗失敗，請稍後重試

# teahouse.hide_banners.restore_failed
source: Failed to restore purchases. Please try again later.
ja: 購入の復元に失敗しました。しばらくしてから再試行してください。
ko: 구매 복원에 실패했습니다. 잠시 후 다시 시도해 주세요.
zh_hans: 恢复购买失败，请稍后重试
zh_hant: 恢復購買失敗，請稍後重試

# teahouse.hide_banners.restore_not_found
source: No restorable purchase was found.
ja: 復元できる購入記録が見つかりませんでした。
ko: 복원할 구매 내역을 찾지 못했습니다.
zh_hans: 未找到可恢复的购买记录
zh_hant: 未找到可恢復的購買記錄

# teahouse.hide_banners.restore_purchase
source: Restore Purchases
ja: 購入を復元
ko: 구매 복원
zh_hans: 恢复购买
zh_hant: 恢復購買

# teahouse.hours_ago
source: %d hours ago
ja: %d時間前
ko: %d시간 전
zh_hans: %d小时前
zh_hant: %d小時前

# teahouse.image.action.copied
source: Image copied
ja: 画像をコピーしました
ko: 이미지 복사됨
zh_hans: 图片已拷贝
zh_hant: 圖片已拷贝

# teahouse.image.action.copy_fallback_link
source: Image copy failed, link copied instead
ja: 画像のコピーに失敗したため、リンクをコピーしました
ko: 이미지 복사 실패, 링크를 대신 복사했습니다
zh_hans: 图片拷贝失败，已拷贝链接
zh_hant: 圖片拷贝失敗，已拷贝链接

# teahouse.image.action.save_failed
source: Save failed: %@
ja: 保存に失敗しました: %@
ko: 저장 실패: %@
zh_hans: 保存失败：%@
zh_hant: 保存失敗：%@

# teahouse.image.action.saved_to_photos
source: Saved to Photos
ja: 写真に保存しました
ko: 사진에 저장됨
zh_hans: 已保存到“照片”
zh_hant: 已保存到“照片”

# teahouse.image.action.title
source: Image Actions
ja: 画像操作
ko: 이미지 작업
zh_hans: 图片操作
zh_hant: 圖片操作

# teahouse.image.error.decode_data_failed
source: Failed to decode image data
ja: 画像データの解析に失敗しました
ko: 이미지 데이터 해석 실패
zh_hans: 无法解析图片数据
zh_hant: 无法解析圖片數據

# teahouse.image.error.decode_remote_failed
source: Failed to decode remote image
ja: ネットワーク画像の解析に失敗しました
ko: 원격 이미지 해석 실패
zh_hans: 无法解析网络图片
zh_hant: 无法解析網絡圖片

# teahouse.image.error.image_not_loaded
source: Image not loaded, unable to save
ja: 画像が未読み込みのため保存できません
ko: 이미지가 로드되지 않아 저장할 수 없습니다
zh_hans: 图片未加载，无法保存
zh_hant: 圖片未加載，无法保存

# teahouse.image.error.photo_permission_denied
source: Photo library write permission not granted
ja: 写真ライブラリの書き込み権限がありません
ko: 사진 라이브러리 쓰기 권한이 없습니다
zh_hans: 未获得相册写入权限
zh_hant: 未獲得相册寫入權限

# teahouse.image.error.photo_permission_unknown
source: Unknown photo library permission status
ja: 写真ライブラリ権限の状態が不明です
ko: 사진 라이브러리 권한 상태를 확인할 수 없습니다
zh_hans: 未知相册权限状态
zh_hant: 未知相册權限狀態

# teahouse.image.error.save_failed
source: Save failed
ja: 保存に失敗しました
ko: 저장실패
zh_hans: 保存失败
zh_hant: 保存失敗

# teahouse.image.menu.copy
source: Copy
ja: コピー
ko: 복사
zh_hans: 拷贝
zh_hant: 拷贝

# teahouse.image.menu.copy_subject
source: Copy Subject
ja: 被写体をコピー
ko: 피사체 복사
zh_hans: 拷贝对象
zh_hant: 拷贝对象

# teahouse.image.menu.lookup
source: Look Up
ja: 検索
ko: 검색
zh_hans: 查询
zh_hant: 查詢

# teahouse.image.menu.save_to_photos
source: Save to Photos
ja: 写真に保存
ko: 사진에 저장
zh_hans: 保存到“照片”
zh_hant: 保存到“照片”

# teahouse.image.menu.share
source: Share
ja: 共有
ko: 공유
zh_hans: 共享
zh_hant: 共享

# teahouse.just_now
source: Just now
ja: たった今
ko: 방금
zh_hans: 刚刚
zh_hant: 刚刚

# teahouse.load_failed
source: Load Failed
ja: 読み込みに失敗しました
ko: 불러오기에 실패했습니다
zh_hans: 加载失败
zh_hant: 載入失敗

# teahouse.local
source: Local
ja: ローカル
ko: 로컬
zh_hans: 本地
zh_hant: 本地

# teahouse.local_badge
source: Local
ja: ローカル
ko: 로컬
zh_hans: 本地
zh_hant: 本地

# teahouse.login.email.placeholder
source: Email
ja: メールアドレス
ko: 이메일
zh_hans: 邮箱
zh_hant: 郵箱

# teahouse.login.failed
source: Sign in failed
ja: ログイン失敗
ko: 로그인실패
zh_hans: 登录失败
zh_hant: 登錄失敗

# teahouse.login.has_account
source: Already have an account? Sign in
ja: アカウント
ko: 계정
zh_hans: 已有账号？点击登录
zh_hant: 已有帳號？點擊登錄

# teahouse.login.logout
source: Sign Out
ja: ログアウトログイン
ko: 로그아웃로그인
zh_hans: 退出登录
zh_hant: 退出登錄

# teahouse.login.nav_title
source: Teahouse
ja: ティーハウス
ko: 티하우스
zh_hans: 茶楼
zh_hant: 茶樓

# teahouse.login.no_account
source: Don't have an account? Sign up
ja: アカウント
ko: 계정
zh_hans: 没有账号？点击注册
zh_hant: 没有帳號？點擊注册

# teahouse.login.password.placeholder
source: Password
ja: パスワード
ko: 비밀번호
zh_hans: 密码
zh_hant: 密碼

# teahouse.login.signin
source: Sign In
ja: ログイン
ko: 로그인
zh_hans: 登录
zh_hant: 登錄

# teahouse.login.signup
source: Sign Up
ja: 登録
ko: 회원가입
zh_hans: 注册
zh_hant: 注册

# teahouse.login.subtitle
source: Sign in to post, like and comment
ja: 投稿・いいね・コメントするにはログインしてください
ko: 게시, 좋아요, 댓글을 하려면 로그인하세요
zh_hans: 登录后可以发帖、点赞和评论
zh_hant: 登錄后可以發帖、點赞和評論

# teahouse.login.title
source: Teahouse Login
ja: 茶楼ログイン
ko: 찻집 로그인
zh_hans: 茶楼登录
zh_hant: 茶樓登錄

# teahouse.minutes_ago
source: %d minutes ago
ja: %d分前
ko: %d분 전
zh_hans: %d分钟前
zh_hant: %d分钟前

# teahouse.no_posts
source: No Posts
ja: 投稿がありません
ko: 게시물이 없습니다
zh_hans: 暂无帖子
zh_hant: 暂无帖子

# teahouse.no_posts_hint
source: Tap the button above to create your first post~
ja: 上のボタンをタップして最初の投稿を作成しましょう~
ko: 위 버튼을 눌러 첫 게시물을 작성해 보세요~
zh_hans: 点击右上角发布第一条帖子吧～
zh_hant: 點擊右上角發佈第一条帖子吧～

# teahouse.no_results
source: No Results
ja: 検索結果がありません
ko: 검색 결과 없음
zh_hans: 无结果
zh_hant: 无結果

# teahouse.not_privilege_user
source: Not a Privilege User
ja: 特権ユーザーではありません
ko: 권한 사용자 아님
zh_hans: 不是特权用户
zh_hant: 不是特權用户

# teahouse.not_privilege_user.message
source: This feature is only available to privilege users
ja: この機能は特権ユーザーのみ利用できます
ko: 이 기능은 권한 사용자만 사용할 수 있습니다
zh_hans: 此功能仅对特权用户开放
zh_hant: 此功能仅对特權用户開放

# teahouse.post.comment.placeholder
source: Comment
ja: コメント
ko: 댓글
zh_hans: 评论
zh_hant: 評論

# teahouse.post.default_title
source: Post
ja: 投稿
ko: 게시물
zh_hans: 帖子
zh_hant: 帖子

# teahouse.post.hidden.message
source: This post was hidden due to too many reports.
ja: 通報が多いため、この投稿は非表示になりました。
ko: 신고가 많아 이 게시물이 숨김 처리되었습니다.
zh_hans: 由于收到过多举报，此帖子已被系统隐藏
zh_hant: 由於收到過多舉報，此帖子已被繫統隱藏

# teahouse.post.hidden.title
source: This post has been hidden
ja: この投稿は非表示になっています
ko: 이 게시물은 숨김 처리되었습니다
zh_hans: 此帖子已被隐藏
zh_hant: 此帖子已被隱藏

# teahouse.post.no_comments
source: No comments yet. Be the first one!
ja: まだコメントがありません。最初のコメントを投稿しましょう！
ko: 아직 댓글이 없습니다. 첫 댓글을 남겨보세요!
zh_hans: 还没有评论，来抢沙发吧~
zh_hant: 還没有評論，來抢沙發吧~

# teahouse.register.confirm_password
source: Confirm Password
ja: パスワード確認
ko: 비밀번호 확인
zh_hans: 确认密码
zh_hant: 確認密碼

# teahouse.register.has_account
source: Already have an account? Click to log in
ja: アカウント
ko: 계정
zh_hans: 已有账号?点击登录
zh_hant: 已有帳號?點擊登錄

# teahouse.register.nav_title
source: Sign Up
ja: 登録
ko: 회원가입
zh_hans: 注册
zh_hant: 注册

# teahouse.register.password_strength
source: Password strength
ja: パスワード強度
ko: 비밀번호 강도
zh_hans: 密码强度
zh_hant: 密碼強度

# teahouse.register.signup
source: Sign Up
ja: 登録
ko: 회원가입
zh_hans: 注册
zh_hant: 注册

# teahouse.register.subtitle
source: Sign up to join the Teahouse community
ja: 登録して茶楼コミュニティに参加
ko: 회원가입하여 찻집 커뮤니티에 참여하세요
zh_hans: 注册后即可参与茶楼互动
zh_hant: 注册后即可参与茶樓互動

# teahouse.register.title
source: Teahouse Sign Up
ja: 茶楼登録
ko: 찻집 회원가입
zh_hans: 茶楼注册
zh_hant: 茶樓注册

# teahouse.retry
source: Retry
ja: 再試行
ko: 다시 시도
zh_hans: 重试
zh_hant: 重試

# teahouse.save_confirm_title
source: Save Changes
ja: 変更を保存
ko: 변경 사항 저장
zh_hans: 保存图片
zh_hant: 保存圖片

# teahouse.save_failed
source: Save Failed
ja: 保存失敗
ko: 저장실패
zh_hans: 保存失败
zh_hant: 保存失敗

# teahouse.save_success
source: Saved
ja: 保存しました
ko: 저장성공
zh_hans: 保存成功
zh_hant: 保存成功

# teahouse.saving
source: Saving...
ja: 保存中...
ko: 저장 중...
zh_hans: 保存中...
zh_hant: 保存中...

# teahouse.search_hint
source: Posts, goods, etc.
ja: 投稿・商品など
ko: 게시물, 상품 등
zh_hans: 帖子、商品等
zh_hant: 帖子、商品等

# teahouse.search_title
source: Search
ja: 検索
ko: 검색
zh_hans: 搜索
zh_hant: 搜尋

# teahouse.summary.button
source: Summarize Post
ja: 投稿を要約
ko: 게시물 요약
zh_hans: 总结帖子
zh_hant: 總結帖子

# teahouse.summary.failed
source: Summary failed: %@
ja: 要約に失敗しました: %@
ko: 요약 실패: %@
zh_hans: 总结失败：%@
zh_hant: 總結失敗：%@

# teahouse.summary.fallback_prefix
source: (Example)\n\n
ja: (例)\n\n
ko: (예시)\n\n
zh_hans: （示例）\n\n
zh_hant: （示例）\n\n

# teahouse.summary.instructions
source: Summarize the text in English within 100 words.
ja: 英語で100語以内に要約してください。
ko: 영어로 100단어 이내로 요약하세요.
zh_hans: 使用中文把文本内容总结到不超过100个字
zh_hant: 使用中文把文本內容總結到不超過100个字

# teahouse.summary.no_content
source: No summary available
ja: 要約はありません
ko: 요약이 없습니다
zh_hans: 没有可显示的总结
zh_hant: 没有可顯示的總結

# teahouse.summary.prompt
source: Title: %@\n\nContent: %@\n\nPlease generate a concise summary of no more than 120 words, highlighting key information and conclusions.
ja: タイトル: %@\n\n内容: %@\n\n重要情報と結論を中心に、120語以内で簡潔に要約してください。
ko: 제목: %@\n\n내용: %@\n\n핵심 정보와 결론을 중심으로 120단어 이내의 간결한 요약을 생성해 주세요.
zh_hans: 标题：%@\n\n内容：%@\n\n请用中文为上面的帖子生成一段不超过 120 字的简洁摘要，突出关键信息与结论。
zh_hant: 標題：%@\n\n內容：%@\n\n請用中文為上面的帖子生成一段不超過 120 字的簡洁摘要，突出關鍵信息与結論。

# teahouse.summary.sheet_title
source: Post Summary
ja: 投稿要約
ko: 게시물 요약
zh_hans: 帖子总结
zh_hant: 帖子總結

# teahouse.summary.unsupported_system
source: Summary is not supported on this system version
ja: このシステムバージョンでは要約機能をサポートしていません
ko: 이 시스템 버전에서는 요약 기능을 지원하지 않습니다
zh_hans: 当前系统版本不支持总结功能
zh_hant: 當前繫統版本不支持總結功能

# teahouse.time.days_ago
source: %d days ago
ja: %d日前
ko: %d일 전
zh_hans: %d天前
zh_hant: %d天前

# teahouse.time.hours_ago
source: %d hrs ago
ja: %d時間前
ko: %d시간 전
zh_hans: %d小时前
zh_hant: %d小時前

# teahouse.time.just_now
source: Just now
ja: たった今
ko: 방금
zh_hans: 刚刚
zh_hant: 刚刚

# teahouse.time.minutes_ago
source: %d min ago
ja: %d分前
ko: %d분 전
zh_hans: %d分钟前
zh_hant: %d分钟前

# teahouse.title
source: Teahouse
ja: ティーハウス
ko: 티하우스
zh_hans: 茶楼
zh_hant: 茶樓

# term.format
source: Term %lld
ja: 第%lld学期
ko: 학기 %lld
zh_hans: 第 %lld 学期
zh_hant: 第 %lld 學期

# terms.agree_prefix
source: I have read and agree to
ja: 同意します
ko: 읽고 동의합니다
zh_hans: 我已经阅读并同意
zh_hant: 我已經閱讀並同意

# terms.privacy_policy
source: Privacy Policy
ja: プライバシーポリシー
ko: 개인정보 처리방침
zh_hans: 《隐私权限》
zh_hant: 《隱私權限》

# terms.user_agreement
source: User Agreement
ja: 《ユーザー协议》
ko: 사용자 계약
zh_hans: 《用户协议》
zh_hant: 《用戶協議》

source: Time
ja: 時間
ko: 시간
zh_hans: 时间
zh_hant: 時間

# time.days_ago
source: %lld days ago
ja: %lld日前
ko: %lld일 전
zh_hans: %lld天前
zh_hant: %lld天前

# time.hours_ago
source: %lld hours ago
ja: %lld時間前
ko: %lld시간 전
zh_hans: %lld小时前
zh_hant: %lld小時前

# time.just_now
source: Just now
ja: たった今
ko: 방금
zh_hans: 刚刚
zh_hant: 剛剛

# time.minutes_ago
source: %lld minutes ago
ja: %lld分前
ko: %lld분 전
zh_hans: %lld分钟前
zh_hant: %lld分鐘前

# training_plan.credits_format
source: %.1f credits
ja: %.1f 単位
ko: %.1f 학점
zh_hans: %.1f 学分
zh_hant: %.1f 學分

# training_plan.export
source: Export Plan
ja: エクスポート
ko: 내보내기
zh_hans: 导出方案
zh_hant: 導出方案

# training_plan.loading_failed
source: Loading Failed
ja: 読み込み失敗
ko: 로딩 실패
zh_hans: 加载失败
zh_hant: 加載失敗

# training_plan.semester_courses
source: Semester Courses
ja: コース
ko: 과목
zh_hans: 本学期课程
zh_hant: 本學期課程

# training_plan.semester_number
source: Semester %lld
ja: 第%lld学期
ko: 제%lld학기
zh_hans: 第 %lld 学期
zh_hant: 第 %lld 學期

# training_plan.title
source: Training Plan
ja: 育成計画
ko: 교육과정
zh_hans: 培养方案
zh_hant: 培养方案

# training.semester_format
source: Semester %d
ja: 第%d学期
ko: 제%d학기
zh_hans: 第 %d 学期
zh_hant: 第 %d 學期

# user_info.college
source: College
ja: 学院
ko: 단과대
zh_hans: 学院
zh_hant: 學院

# user_info.error.missing_username
source: User information missing
ja: ユーザー信息缺失
ko: 사용자信息缺失
zh_hans: 用户信息缺失
zh_hant: 用户信息缺失

# user_info.error.no_data
source: No user information found
ja: 未検索到ユーザー信息
ko: 未검색到사용자信息
zh_hans: 未查询到用户信息
zh_hant: 未查詢到用户信息

# user_info.error.please_login
source: Please login first
ja: まずログインしてください
ko: 먼저 로그인해주세요
zh_hans: 请先登录
zh_hant: 請先登錄

# user_info.loading_failed
source: Loading Failed
ja: 読み込み失敗
ko: 로딩 실패
zh_hans: 加载失败
zh_hant: 加載失敗

# user_info.title
source: User Info
ja: ユーザー信息
ko: 사용자信息
zh_hans: 用户信息
zh_hant: 用户信息

# user_posts.anonymous_user
source: Anonymous
ja: 匿名ユーザー
ko: 익명 사용자
zh_hans: 匿名用户
zh_hant: 匿名用户

# user_posts.commented_posts
source: Commented Posts
ja: 我コメント的
ko: 我댓글的
zh_hans: 我评论的
zh_hant: 我評論的

# user_posts.days_ago
source: %d days ago
ja: %d日前
ko: %d일 전
zh_hans: %d天前
zh_hant: %d天前

# user_posts.delete_comment_failed
source: Delete comment failed: %@
ja: 削除コメント失敗: %@
ko: 삭제댓글실패: %@
zh_hans: 删除评论失败: %@
zh_hant: 刪除評論失敗: %@

# user_posts.delete_failed
source: Delete failed: %@
ja: 削除失敗: %@
ko: 삭제실패: %@
zh_hans: 删除失败: %@
zh_hant: 刪除失敗: %@

# user_posts.hours_ago
source: %d hours ago
ja: %d時間前
ko: %d시간 전
zh_hans: %d小时前
zh_hant: %d小時前

# user_posts.just_now
source: Just now
ja: たった今
ko: 방금
zh_hans: 刚刚
zh_hant: 刚刚

# user_posts.liked_posts
source: Liked Posts
ja: 我いいね的
ko: 我좋아요的
zh_hans: 我点赞的
zh_hant: 我點赞的

# user_posts.minutes_ago
source: %d minutes ago
ja: %d分前
ko: %d분 전
zh_hans: %d分钟前
zh_hant: %d分钟前

# user_posts.my_posts
source: My Posts
ja: 私の投稿
ko: 내 게시물
zh_hans: 我发的帖
zh_hant: 我發的帖

# user_posts.no_title
source: No Title
ja: タイトルなし
ko: 제목 없음
zh_hans: 无标题
zh_hant: 無標題

# competition.summary.button
source: Summarize
ja: 要約
ko: 요약
zh_hans: 总结
zh_hant: 總結

# competition.summary.failed
source: Summary failed: %@
ja: 要約に失敗しました: %@
ko: 요약 실패: %@
zh_hans: 总结失败：%@
zh_hant: 總結失敗：%@

# competition.summary.no_content
source: No summary available
ja: 要約内容がありません
ko: 요약 내용이 없습니다
zh_hans: 暂无总结内容
zh_hant: 暫無總結內容

# competition.summary.sheet_title
source: Competition Summary
ja: コンテスト要約
ko: 대회 요약
zh_hans: 竞赛总结
zh_hant: 競賽總結
